python/python-herramientas-para-principiantes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-19 Fri 17:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python, Herramientas Básicas Para Principiantes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="erretres" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python, Herramientas Básicas Para Principiantes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#herramientas">1. Herramientas</a>
<ul>
<li><a href="#linters">1.1. Linters</a></li>
<li><a href="#formateadores-de-codigo">1.2. Formateadores de Código</a></li>
</ul>
</li>
<li><a href="#referencias">2. Referencias</a></li>
</ul>
</div>
</div>
<p>
&nbsp;&nbsp; La primera dificultad a la hora de aprender a programar es el hecho de tener que memorizar una serie de reglas acerca de espacios, identificadores, operadores (entre otras cosas).  Ésto que parece ser trivial suele derivar en que muchos cursos/libros/vídeos se limiten a enseñar uno de los aspectos más superficiales de la programación: la sintaxis.<br />
</p>

<p>
&nbsp;&nbsp; Pero claro, que algo se superficial no significa que no sea importante (después de todo necesitamos un programa  correcto/válido para que pueda ser ejecutado).
</p>

<p>
&nbsp;&nbsp; Los "errores de sintaxis" son comunes y normalmente son difíciles de detectar para un humano, lo que significa en que se desperdician muchas horas solucionando un problema que puede ser evitado y que puede ser resuelto por una máquina en una fracción de segundo. 
Existen varias herramientas que nos pueden ayudar:
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Lint_(software)">Linters</a>: "lint, o linter, es una herramienta de análisis estático de código que se utiliza para señalar errores de programación, fallos, errores de estilo y construcciones sospechosas"<br /></li>
</ul>


<ul class="org-ul">
<li>Formateadores de código:  A diferencia de un linter un formateador de código permite mantener la consistencia del "estilo" (siempre el mismo número de espacios, symbolos etc).</li>
</ul>

<div id="outline-container-org7ef2134" class="outline-2">
<h2 id="herramientas"><span class="section-number-2">1</span> Herramientas</h2>
<div class="outline-text-2" id="text-herramientas">
</div>

<div id="outline-container-org5ec1f53" class="outline-3">
<h3 id="linters"><span class="section-number-3">1.1</span> Linters</h3>
<div class="outline-text-3" id="text-linters">
<p>
<a href="https://pylint.org/">https://pylint.org/</a>
</p>

<blockquote>
<p>
Pylint is a Python static code analysis tool which looks for programming errors, helps enforcing a coding standard, sniffs for code smells and offers simple refactoring suggestions.
</p>
</blockquote>


<p>
<a href="https://flake8.pycqa.org/en/latest/manpage.html">https://flake8.pycqa.org/en/latest/manpage.html</a>
</p>
<blockquote>
<p>
flake8 is a command-line utility for enforcing style consistency across Python projects. By default it includes lint checks provided by the PyFlakes project, PEP-0008 inspired style checks provided by the PyCodeStyle project, and McCabe complexity checking provided by the McCabe project. It will also run third-party extensions if they are found and installed.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgda7cdfb" class="outline-3">
<h3 id="formateadores-de-codigo"><span class="section-number-3">1.2</span> Formateadores de Código</h3>
<div class="outline-text-3" id="text-formateadores-de-codigo">
<p>
<a href="https://black.readthedocs.io/en/stable/">https://black.readthedocs.io/en/stable/</a>
</p>

<blockquote>
<p>
Black is the uncompromising Python code formatter. By using it, you agree to cede control over minutiae of hand-formatting. In return, Black gives you speed, determinism, and freedom from pycodestyle nagging about formatting. You will save time and mental energy for more important matters.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgc589167" class="outline-2">
<h2 id="referencias"><span class="section-number-2">2</span> Referencias</h2>
<div class="outline-text-2" id="text-referencias">
<p>
<a href="https://en.wikipedia.org/wiki/Lint_(software)">https://en.wikipedia.org/wiki/Lint_(software)</a>
<a href="https://en.wikipedia.org/wiki/Programming_style">https://en.wikipedia.org/wiki/Programming_style</a>
<a href="https://en.wikipedia.org/wiki/Best_coding_practices#Coding_standards">https://en.wikipedia.org/wiki/Best_coding_practices#Coding_standards</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: erretres</p>
<p class="date">Created: 2021-03-19 Fri 17:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
